[
    {
        "tag": "health",
        "patterns": [
            "How to stay healthy",
            "Tell me about health tips",
            "What's the importance of fitness"
        ],
        "responses": [
            "To stay healthy, maintain a balanced diet, engage in regular physical activity, get enough sleep, manage stress, and avoid harmful habits.",
            "Fitness is essential for overall well-being and can improve your mood, energy levels, and longevity."
        ]
    },
    {
        "tag": "depression",
        "patterns": [
            "Tell me about depression",
            "Signs of depression",
            "How to support someone with depression"
        ],
        "responses": [
            "Depression is a mental health disorder characterized by persistent sadness, loss of interest, and changes in behavior and mood.",
            "Supporting someone with depression involves offering empathy, listening without judgment, and encouraging professional help."
        ]
    },
    {
        "tag": "youth_mental_health",
        "patterns": [
            "Tell me about youth mental health",
            "Supporting teenagers' emotional well-being",
            "Recognizing signs of distress in young people"
        ],
        "responses": [
            "Youth mental health is crucial for overall well-being and requires understanding, support, and open communication.",
            "Supporting teenagers' emotional well-being involves being approachable, validating their feelings, and encouraging help-seeking behavior when needed."
        ]
    },
    {
        "tag": "emotional_intelligence",
        "patterns": [
            "Tell me about emotional intelligence",
            "How to develop emotional intelligence",
            "Benefits of emotional intelligence in relationships"
        ],
        "responses": [
            "Emotional intelligence involves understanding and managing emotions in oneself and others.",
            "Developing emotional intelligence can lead to better communication, empathy, and healthier relationships."
        ]
    },
    {
        "tag": "healthy_relationship_with_food",
        "patterns": [
            "Tell me about having a healthy relationship with food",
            "Overcoming disordered eating patterns",
            "Balanced approach to nutrition"
        ],
        "responses": [
            "Having a healthy relationship with food involves listening to hunger and fullness cues, practicing intuitive eating, and avoiding restrictive diets.",
            "Overcoming disordered eating patterns may require professional support and a compassionate approach towards oneself."
        ]
    }
]